In [3]:
import pandas as pd

In [34]:
# read df and clear
df = pd.read_excel("./data/Live_20210128.xlsx", )

In [35]:
df

     status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys,Column1,Column2,Column3,Column4
0     1,video,4/22/2018 6:00,529,512,262,432,92,3,1,...
1     2,photo,4/21/2018 22:45,150,0,0,150,0,0,0,0,0,,,,
2     3,video,4/21/2018 6:17,227,236,57,204,21,1,1,0...
3      4,photo,4/21/2018 2:29,111,0,0,111,0,0,0,0,0,,,,
4      5,photo,4/18/2018 3:22,213,0,0,204,9,0,0,0,0,,,,
...                                                 ...
7045  7046,photo,9/24/2016 2:58,89,0,0,89,0,0,0,0,0,,,,
7046  7047,photo,9/23/2016 11:19,16,0,0,14,1,0,1,0,0...
7047   7048,photo,9/21/2016 23:03,2,0,0,1,1,0,0,0,0,,,,
7048  7049,photo,9/20/2016 0:43,351,12,22,349,2,0,0,...
7049  7050,photo,9/10/2016 10:30,17,0,0,17,0,0,0,0,0...

[7050 rows x 1 columns]

In [36]:
# make the separation by comma
df_filtered = df.iloc[:, 0].str.split(',', expand=True)
df_filtered.columns = [n.replace('"', '') for n in df.columns.str.split(',')[0]]
df = df_filtered

In [37]:
# analyse the data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7050 entries, 0 to 7049
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   status_id         7050 non-null   object
 1   status_type       7050 non-null   object
 2   status_published  7050 non-null   object
 3   num_reactions     7050 non-null   object
 4   num_comments      7050 non-null   object
 5   num_shares        7050 non-null   object
 6   num_likes         7050 non-null   object
 7   num_loves         7050 non-null   object
 8   num_wows          7050 non-null   object
 9   num_hahas         7050 non-null   object
 10  num_sads          7050 non-null   object
 11  num_angrys        7050 non-null   object
 12  Column1           7050 non-null   object
 13  Column2           7050 non-null   object
 14  Column3           7050 non-null   object
 15  Column4           7050 non-null   object
dtypes: object(16)
memory usage: 881.4+ KB

### set appropriate datatypes

In [38]:
df["status_id"] = df["status_id"].astype("int")

In [39]:
print(df["status_type"].value_counts())
df["status_type"] = df["status_type"].astype("category")

status_type
photo     4288
video     2334
status     365
link        63
Name: count, dtype: int64

In [40]:
print(df["status_published"])
df["status_published"] = pd.to_datetime(df["status_published"])

0        4/22/2018 6:00
1       4/21/2018 22:45
2        4/21/2018 6:17
3        4/21/2018 2:29
4        4/18/2018 3:22
             ...
7045     9/24/2016 2:58
7046    9/23/2016 11:19
7047    9/21/2016 23:03
7048     9/20/2016 0:43
7049    9/10/2016 10:30
Name: status_published, Length: 7050, dtype: object

In [43]:
# all num variables to int
df["num_reactions"] = df["num_reactions"].astype("int")
df["num_comments"] = df["num_comments"].astype("int")
df["num_shares"] = df["num_shares"].astype("int")
df["num_likes"] = df["num_likes"].astype("int")
df["num_loves"] = df["num_loves"].astype("int")
df["num_wows"] = df["num_wows"].astype("int")
df["num_hahas"] = df["num_hahas"].astype("int")
df["num_sads"] = df["num_sads"].astype("int")
df["num_angrys"] = df["num_angrys"].astype("int")

In [46]:
# drop the last 4 columns
df = df.drop(["Column1", "Column2", "Column3", "Column4"], axis="columns")

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7050 entries, 0 to 7049
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   status_id         7050 non-null   int32
 1   status_type       7050 non-null   category
 2   status_published  7050 non-null   datetime64[ns]
 3   num_reactions     7050 non-null   int32
 4   num_comments      7050 non-null   int32
 5   num_shares        7050 non-null   int32
 6   num_likes         7050 non-null   int32
 7   num_loves         7050 non-null   int32
 8   num_wows          7050 non-null   int32
 9   num_hahas         7050 non-null   int32
 10  num_sads          7050 non-null   int32
 11  num_angrys        7050 non-null   int32
dtypes: category(1), datetime64[ns](1), int32(10)
memory usage: 337.7 KB

#### no problems were thrown by the conversion to int => the data does not contain any nan values
#### now check for duplicates -> first check if there are more than one of the same id, then check if records have different ids but the same data

In [53]:
df.nunique()

status_id           7050
status_type            4
status_published    6913
num_reactions       1067
num_comments         993
num_shares           501
num_likes           1044
num_loves            229
num_wows              65
num_hahas             42
num_sads              24
num_angrys            14
dtype: int64

#### the status_ids are different, but there are more than one status_published in the same point of time which is strange -> check if the other values are different

In [59]:
df.drop("status_id", axis="columns").drop_duplicates()

,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
0,video,2018-04-22 06:00:00,529,512,262,432,92,3,1,1,0
1,photo,2018-04-21 22:45:00,150,0,0,150,0,0,0,0,0
2,video,2018-04-21 06:17:00,227,236,57,204,21,1,1,0,0
3,photo,2018-04-21 02:29:00,111,0,0,111,0,0,0,0,0
4,photo,2018-04-18 03:22:00,213,0,0,204,9,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...
7045,photo,2016-09-24 02:58:00,89,0,0,89,0,0,0,0,0
7046,photo,2016-09-23 11:19:00,16,0,0,14,1,0,1,0,0
7047,photo,2016-09-21 23:03:00,2,0,0,1,1,0,0,0,0
7048,photo,2016-09-20 00:43:00,351,12,22,349,2,0,0,0,0
7049,photo,2016-09-10 10:30:00,17,0,0,17,0,0,0,0,0

#### there are values that are the same => drop them

In [58]:
df = df[df.index.isin(df.drop("status_id", axis="columns").drop_duplicates().index)]

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
0,1,video,2018-04-22 06:00:00,529,512,262,432,92,3,1,1,0
1,2,photo,2018-04-21 22:45:00,150,0,0,150,0,0,0,0,0
2,3,video,2018-04-21 06:17:00,227,236,57,204,21,1,1,0,0
3,4,photo,2018-04-21 02:29:00,111,0,0,111,0,0,0,0,0
4,5,photo,2018-04-18 03:22:00,213,0,0,204,9,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
7045,7046,photo,2016-09-24 02:58:00,89,0,0,89,0,0,0,0,0
7046,7047,photo,2016-09-23 11:19:00,16,0,0,14,1,0,1,0,0
7047,7048,photo,2016-09-21 23:03:00,2,0,0,1,1,0,0,0,0
7048,7049,photo,2016-09-20 00:43:00,351,12,22,349,2,0,0,0,0
7049,7050,photo,2016-09-10 10:30:00,17,0,0,17,0,0,0,0,0